particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
/*
 * Copyright (c) 2019 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#undef LOG_COMPILE_TIME_LEVEL
#include "logging.h"
LOG_SOURCE_CATEGORY("hal.ble");

#include "ble_hal.h"

#if HAL_PLATFORM_BLE

#ifdef __cplusplus
extern "C" {
#endif
#include "rtl8721d.h"
#ifdef __cplusplus
} // extern "C"
#endif

extern "C" {
#include "rtk_coex.h"
}

#include <platform_opts_bt.h>
#include <os_sched.h>
#include <string.h>
#include <trace_app.h>
#include <gap.h>
#include <gap_adv.h>
#include <gap_scan.h>
#include <gap_bond_le.h>
#include <gap_conn_le.h>
#include <profile_server.h>
#include <gatt_builtin_services.h>
#include <gap_msg.h>
#include <simple_ble_service.h>
#include <bas.h>
#include <bte.h>
#include <gap_config.h>
#include <bt_flags.h>
#include <stdio.h>
#include "wifi_constants.h"
#include <wifi/wifi_conf.h>
#include "rtk_coex.h"
#include "ftl_int.h"
#include "rtl8721d.h"
#include "bt_intf.h"

//FIXME
#include "app_msg.h"
#include "os_msg.h"
#include "os_task.h"

#include "delay_hal.h"
#include "device_code.h"
#include "concurrent_hal.h"
#include "static_recursive_mutex.h"
#include <mutex>
#include "spark_wiring_vector.h"
#include <string.h>
#include <memory>
#include "check.h"
#include "scope_guard.h"
#include "rtl_system_error.h"
#include "radio_common.h"
#include "freertos/wrapper.h"

#include "timer_hal.h"

#include "mbedtls/ecdh.h"
#include "mbedtls_util.h"
#include "spark_wiring_thread.h"

// FIXME
#undef OFF
#undef ON
#include "network/ncp/wifi/ncp.h"
#include "network/ncp/wifi/wifi_network_manager.h"
#include "network/ncp/wifi/wifi_ncp_client.h"

using spark::Vector;
using namespace particle;
using namespace particle::ble;

struct pcoex_reveng {
    uint32_t state;
    uint32_t unknown;
    _mutex* mutex;
};

extern "C" pcoex_reveng* pcoex[4];

extern "C" Rltk_wlan_t rltk_wlan_info[NET_IF_NUM];
extern "C" int rtw_coex_wifi_enable(void* priv, uint32_t state);
extern "C" int rtw_coex_bt_enable(void* priv, uint32_t state);

namespace {

#define CHECK_RTL(_expr) \
        ({ \
            const auto _ret = _expr; \
            if (_ret != GAP_CAUSE_SUCCESS) { \
                _LOG_CHECKED_ERROR(_expr, rtl_ble_error_to_system(_ret)); \
                return rtl_ble_error_to_system(_ret); \
            } \
            _ret; \
        })

StaticRecursiveMutex s_bleMutex;

void rtwCoexRunDisable() {
    os_thread_scheduling(false, nullptr);
    auto p = pcoex[0];
    if (p && (p->state & 0x000000ff) != 0x00) {
        p->state &= 0xffffff00;
    }
    os_thread_scheduling(true, nullptr);
}

void rtwCoexRunEnable() {
    os_thread_scheduling(false, nullptr);
    auto p = pcoex[0];
    if (p) {
        p->state |= 0x01;
    }
    os_thread_scheduling(true, nullptr);
}

void rtwCoexCleanup() {
    auto p = pcoex[0];
    if (p && p->mutex) {
        auto m = p->mutex;
        p->mutex = nullptr;
        rtw_mutex_free(m);
    }
}

bool isUuidEqual(const hal_ble_uuid_t* uuid1, const hal_ble_uuid_t* uuid2) {
    if (uuid1->type != uuid2->type) {
        return false;
    }
    if (uuid1->type == BLE_UUID_TYPE_128BIT) {
        return memcmp(uuid1->uuid128, uuid2->uuid128, BLE_SIG_UUID_128BIT_LEN) == 0;
    } else {
        return uuid1->uuid16 == uuid2->uuid16;
    }
}

bool addressEqual(const hal_ble_addr_t& srcAddr, const hal_ble_addr_t& destAddr) {
    return (srcAddr.addr_type == destAddr.addr_type && !memcmp(srcAddr.addr, destAddr.addr, BLE_SIG_ADDR_LEN));
}

} //anonymous namespace


class BleEventDispatcher {
public:
    int start();
    int stop();

    static BleEventDispatcher& getInstance() {
        static BleEventDispatcher instance;
        return instance;
    }

    bool isThreadCurrent() const {
        if (!thread_) {
            return false;
        }

        return os_thread_current(nullptr) == thread_;
    }

private:
    BleEventDispatcher()
            : thread_(nullptr),
              allEvtQueue_(nullptr),
              ioEvtQueue_(nullptr) {
    }
    ~BleEventDispatcher() = default;

    void handleIoMessage(T_IO_MSG message) const;
    static void bleEventDispatchThread(void *context);

    void cleanup();

    void* thread_;
    void* allEvtQueue_;
    void* ioEvtQueue_;
    static constexpr uint8_t BLE_EVENT_THREAD_PRIORITY = 2; // Higher value, higher priority
    static constexpr uint8_t MAX_NUMBER_OF_GAP_MESSAGE = 0x20;
    static constexpr uint8_t MAX_NUMBER_OF_IO_MESSAGE = 0x20;
    static constexpr uint8_t MAX_NUMBER_OF_EVENT_MESSAGE = (MAX_NUMBER_OF_GAP_MESSAGE + MAX_NUMBER_OF_IO_MESSAGE);
    static constexpr uint8_t BLE_EVENT_STOP = 0xff;
    static constexpr system_tick_t BLE_EVENT_SEND_TIMEOUT_MS = 5000;
};

union RtlGapDevState {
    T_GAP_DEV_STATE state;
    uint8_t raw;
    static_assert(sizeof(state) == sizeof(raw), "Size of T_GAP_DEV_STATE does not match uint8_t");
};

class BleGapDevState {
public:
    BleGapDevState()
            : state_{},
              initSet_{false},
              advSet_{false},
              advSubSet_{false},
              scanSet_{false},
              connSet_{false} {
    }

    explicit BleGapDevState(RtlGapDevState s)
            : state_(s),
              initSet_{true},
              advSet_{true},
              advSubSet_{true},
              scanSet_{true},
              connSet_{true} {
    }

    BleGapDevState(BleGapDevState&& other) = default;
    BleGapDevState(const BleGapDevState& other) = default;

    BleGapDevState& init(uint8_t state) {
        state_.state.gap_init_state = state;
        initSet_ = true;
        return *this;
    }
    BleGapDevState& adv(uint8_t state) {
        state_.state.gap_adv_state = state;
        advSet_ = true;
        return *this;
    }
    BleGapDevState& advSub(uint8_t state) {
        state_.state.gap_adv_sub_state = state;
        advSubSet_ = true;
        return *this;
    }
    BleGapDevState& scan(uint8_t state) {
        state_.state.gap_scan_state = state;
        scanSet_ = true;
        return *this;
    }
    BleGapDevState& conn(uint8_t state) {
        state_.state.gap_conn_state = state;
        connSet_ = true;
        return *this;
    }

